app/views/students/index.html.erb

SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
                            <li>
                            Instructor: <%= "#{Faculty.find_by(id: @current_student.course_number)&.fname} #{Faculty.find_by(id: @current_student.course_number)&.lname} (#{Faculty.find_by(id: @current_student.course_number)&.email})" %>

SELECT "presentations".* FROM "presentations" WHERE "presentations"."student_id" = ?  [["student_id", 23]]
---
                        <h2>My Presentations:</h2>
                        <% presentations = Presentation.where(student_id: @current_student.id) %>