app/views/students/new.html.erb

SELECT "faculties".* FROM "faculties"
SELECT 1 AS one FROM "faculties" LIMIT ?  [["LIMIT", 1]]
---
          <i class="fas fa-users"></i>
            <% if Faculty.any? %>
              <%= form.collection_select :course_number, Faculty.all, :id, ->(faculty) { "#{faculty.fname} #{faculty.lname}'s Course" }, { prompt: 'Select Course' }, { class: 'select' } %>