app/controllers/application_controller.rb

    def current_student
      @current_student ||= Student.find_by(id: session[:student_id]) if session[:student_id]
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def current_faculty
      @current_faculty ||= Faculty.find_by(id: session[:faculty_id]) if session[:faculty_id]
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]