app/controllers/evaluations_controller.rb

INSERT INTO "evaluations" ("score", "feedback", "student_id", "presentation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["score", 9], ["feedback", "sadfghjkjhgf"], ["student_id", 41], ["presentation_id", 23], ["created_at", "2023-12-08 05:12:14.991952"], ["updated_at", "2023-12-08 05:12:14.991952"]]
---
    def create
        @evaluation = current_student.evaluations.new(evaluation_params)

        if @evaluation.save