app/controllers/faculties_controller.rb

INSERT INTO "faculties" ("fname", "lname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @faculty = Faculty.new(faculty_params)

    if @faculty.save

SELECT "students".* FROM "students" WHERE "students"."course_number" = ?  [["course_number", "1"]]
SELECT "presentations".* FROM "presentations"
SELECT "evaluations".* FROM "evaluations"
---
  def index
    @current_faculty = current_faculty
    @students = Student.where(course_number: @current_faculty.id)
    @presentations = Presentation.all
    @evaluations = Evaluation.all