app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def new
    @presentation = Presentation.new
    @current_faculty = current_faculty
    @students = Student.where(course_number: @current_faculty.id)
---
SELECT "students".* FROM "students" WHERE "students"."course_number" = ?  [["course_number", "1"]]

  def create
    @presentation = Presentation.new(presentation_params)
    @presentation.faculty_id = current_faculty.id

    respond_to do |format|
      if @presentation.save
---
INSERT INTO "presentations" ("title", "content", "created_at", "updated_at", "date", "grade", "presentation_id", "student_id", "faculty_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @presentation.destroy!
---
DELETE FROM "presentations" WHERE "presentations"."id" = ?  [["id", 1]]

    def set_presentation
      @presentation = Presentation.find(params[:id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]