app/controllers/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "johndoe@gmail.com"], ["LIMIT", 1]]
---
    def create_student
      student = Student.find_by(email: params[:email])

SELECT "faculties".* FROM "faculties" WHERE "faculties"."email" = ? LIMIT ?  [["email", "travers.47@osu.edu"], ["LIMIT", 1]]
---
    def create_faculty
      faculty = Faculty.find_by(email: params[:email])