app/controllers/students_controller.rb

INSERT INTO "students" ("fname", "lname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["fname", "John"], ["lname", "Doe"], ["email", "johndoe@gmail.com"], ["created_at", "2023-12-07 03:49:22.483203"], ["updated_at", "2023-12-07 03:49:22.483203"], ["password_digest", "[FILTERED]"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save

UPDATE "students" SET "updated_at" = ?, "password_digest" = ? WHERE "students"."id" = ?  [["updated_at", "2023-12-07 15:40:22.939702"], ["password_digest", "[FILTERED]"], ["id", 1]]
---
  def update
    if @current_student.update(student_params)